AccumulationRegisters/ТоварыОрганизацийКПередаче.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыОрганизацийКПередаче</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Возвращено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>НалоговоеНазначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НалоговыеНазначенияАктивовИЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорВидЗапасов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЗапасов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Первичное</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументРеализации</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВнутреннееПотреблениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриобретениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаТоваровМеждуОрганизациями</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ОрганизацияВладелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>АналитикаУчетаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиАналитикиУчетаНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЗапасовПродавца</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЗапасов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерГТД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатураГТД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ТоварыОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыОрганизаций</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КОформлениюСписания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НалоговоеНазначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НалоговыеНазначенияАктивовИЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорАналитикаУчетаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиАналитикиУчетаНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорВидЗапасов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЗапасов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОрганизацияОтгрузки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументРеализации</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВнутреннееПотреблениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриобретениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаТоваровМеждуОрганизациями</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяРасходов</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиРасходов</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиАктивовПассивов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АналитикаРасходов</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СтатьиРасходов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АналитикаАктивовПассивов</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СтатьиАктивовПассивов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетПартий</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Первичное</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьПартияПроизводства</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СборкаТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>АналитикаУчетаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиАналитикиУчетаНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЗапасов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЗапасов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерГТД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатураГТД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/АналитикаУчетаНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>АналитикаУчетаНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КлючАналитики</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиАналитикиУчетаНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Серия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МестоХранения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяКалькуляции</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ВидыЗапасов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>ВидыЗапасов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗапасов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЗапасов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НалогообложениеНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНалогообложенияНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецТовара</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Соглашение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СоглашенияСПоставщиками</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеализацияЗапасовДругойОрганизации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗапасовВладельца</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЗапасов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособПередачиТоваров</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыПередачиТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УстарелоПоставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УстарелоПредназначение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПредназначенияВидовЗапасов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УстарелоПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УстарелоМенеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УстарелоСделка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СделкиСКлиентами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаФинансовогоУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыФинансовогоУчетаНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыМеждуОрганизациями</v8:Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УстарелоНазначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыАналитическогоУчетаНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦенПоставщиков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоДубль</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Устаревший</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НалоговоеНазначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НалоговыеНазначенияАктивовИЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

AccumulationRegisters/ТоварыОрганизацийКПередаче/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Структура допустимых отборов товаров к передаче {Склад, Организация, ОрганизацияПолучатель, НачалоПериода, КонецПериода}.
//
// Параметры:
//	Отборы - Структура - значения отборов товаров к передаче.
//
// Возвращаемое значение:
//	Структура - допустимые отборы товаров к передаче.
//
Функция ОтборыТоваровКПередаче(Отборы = Неопределено) Экспорт
	ДоступныеПоляОтбора = Новый Структура();
	ДоступныеПоляОтбора.Вставить("Склад", Неопределено);
	ДоступныеПоляОтбора.Вставить("Организация", Неопределено);
	ДоступныеПоляОтбора.Вставить("ОрганизацияПолучатель", Неопределено);
    ДоступныеПоляОтбора.Вставить("НалоговоеНазначение", Неопределено);
	ДоступныеПоляОтбора.Вставить("ТипЗапасов", Неопределено);
	ДоступныеПоляОтбора.Вставить("НачалоПериода", '00010101');
	ДоступныеПоляОтбора.Вставить("КонецПериода", '39991231235959');
	
	Если Неопределено <> Отборы Тогда
		ЗаполнитьЗначенияСвойств(ДоступныеПоляОтбора, Отборы);
	КонецЕсли;
	Возврат ДоступныеПоляОтбора;
КонецФункции

// Перечень (таблица) позиций и количеств к оформлению передач в разрезе измерений регистра товаров к передаче.
//
// Параметры:
//	Отборы - Структура - значения отборов товаров к передаче.
//
// Возвращаемое значение:
//	ТаблицаЗначений - данные для оформления передач товаров.
//
Функция ТоварыКПередаче(Отборы = Неопределено) Экспорт
	ВсеОтборы = ОтборыТоваровКПередаче(Отборы);
	
	НачалоТоваровКПередаче = НачалоТоваровКПередаче(ВсеОтборы.Организация, ВсеОтборы.Склад);
	
	Запрос = Новый Запрос(ТекстОстаткиКПередачеИПотреблению());
	Запрос.УстановитьПараметр("НачалоПериода",
		НачалоМесяца(?(ЗначениеЗаполнено(ВсеОтборы.НачалоПериода), ВсеОтборы.НачалоПериода, НачалоТоваровКПередаче)));
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(ВсеОтборы.КонецПериода));
	Запрос.УстановитьПараметр("Склад", ВсеОтборы.Склад);
	Запрос.УстановитьПараметр("Организация", ВсеОтборы.Организация);
	Запрос.УстановитьПараметр("ОрганизацияПолучатель", ВсеОтборы.ОрганизацияПолучатель);
    Запрос.УстановитьПараметр("НалоговоеНазначение", ВсеОтборы.НалоговоеНазначение);
	Запрос.УстановитьПараметр("ТипЗапасов", ВсеОтборы.ТипЗапасов);
	Запрос.УстановитьПараметр("ГраницаПериода", Новый Граница(КонецМесяца(ВсеОтборы.КонецПериода), ВидГраницы.Включая));
	Результат = Запрос.Выполнить();
	
	ТоварыКПередаче = Новый ТаблицаЗначений;
	Для Каждого Колонка Из Результат.Колонки Цикл
		Имя = Колонка.Имя;
		Если Имя = "ПериодПрихода" Или Имя = "Передано" Тогда
			Продолжить;
		КонецЕсли;
		ТоварыКПередаче.Колонки.Добавить(Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	
	Передано = 0.;
	Потребление = Неопределено;
	Измерение = Новый Структура(
		"НомерГТД, ВидЗапасовПолучателя, Отправитель, Склад, АналитикаУчетаНоменклатуры, Месяц, Потребления");
	Измерение.Потребления = ТоварыКПередаче.СкопироватьКолонки();

	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		ИзмерениеИзменилось =
			Измерение.АналитикаУчетаНоменклатуры <> Выборка.АналитикаУчетаНоменклатуры
			Или Измерение.Склад <> Выборка.Склад
			Или Измерение.Отправитель <> Выборка.Отправитель
			Или Измерение.ВидЗапасовПолучателя <> Выборка.ВидЗапасовПолучателя
			Или Измерение.НомерГТД <> Выборка.НомерГТД
			Или Измерение.Месяц <> НачалоМесяца(Выборка.Период);
		Если ИзмерениеИзменилось Тогда
			ДополнитьТоварыКПередаче(ТоварыКПередаче, Измерение.Потребления, Передано, ВсеОтборы);
			
			Передано = 0.;
			Потребление = Неопределено;
			ЗаполнитьЗначенияСвойств(Измерение, Выборка);
			Измерение.Месяц = НачалоМесяца(Выборка.Период);
			Измерение.Потребления.Очистить();
		КонецЕсли;
		
		Если Выборка.Потреблено > Передано Тогда
			Если Потребление = Неопределено Или Выборка.ДатаОформления > Потребление.ДатаОформления Тогда
				Потребление = Измерение.Потребления.Добавить();
				ЗаполнитьЗначенияСвойств(Потребление, Выборка);
				Потребление.Потреблено = 0.;
			КонецЕсли;
			Потребление.Потреблено = Потребление.Потреблено + Выборка.Потреблено - Передано;
			Потребление.Период = Макс(Потребление.Период, Выборка.Период);
			Передано = 0.;
		Иначе
			Передано = Передано + Выборка.Передано - Выборка.Потреблено;
		КонецЕсли;
		
	КонецЦикла;
	ДополнитьТоварыКПередаче(ТоварыКПередаче, Измерение.Потребления, Передано, ВсеОтборы);
	
	Возврат ТоварыКПередаче;
КонецФункции

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(ОрганизацияВладелец)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НачалоТоваровКПередаче(Организация, Склад)
	Запрос = Новый Запрос("
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ТТ.Период КАК Период,
		|	ТТ.ОрганизацияВладелец,
		|	ТТ.АналитикаУчетаНоменклатуры,
		|	ТТ.ВидЗапасовПродавца,
		|	ТТ.НомерГТД,
		|	ТТ.КоличествоПриход,
		|	ТТ.КоличествоРасход
		|ИЗ
		|	РегистрНакопления.ТоварыОрганизацийКПередаче.Обороты( , , МЕСЯЦ,
		|		&Организация В (НЕОПРЕДЕЛЕНО, ОрганизацияВладелец)
		|	) КАК ТТ
		|ГДЕ
		|	ТТ.КоличествоПриход > ТТ.КоличествоРасход
		|	И &Склад В (НЕОПРЕДЕЛЕНО, ТТ.АналитикаУчетаНоменклатуры.СкладскаяТерритория)
		|УПОРЯДОЧИТЬ ПО
		|	ТТ.Период
		|");
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Склад", Склад);
	Выборка = Запрос.Выполнить().Выбрать();
	Возврат ?(Выборка.Следующий(), Выборка.Период, '00010101');
КонецФункции

// Текст запроса остатков к передаче и потреблению на каждый день.
// Поля результата запроса:
//		{Период, ДатаОформления, Отправитель, Получатель, Склад, АналитикаУчетаНоменклатуры,
//		ВидЗапасов, НомерГТД, ВидЗапасовПолучателя, НалоговоеНазначение, ТипЗапасов,
//		Передано, Потреблено}
// Упорядоченность:
//		{Получатель, ВидЗапасовПолучателя, Отправитель, АналитикаУчетаНоменклатуры, НомерГТД, Период}.
Функция ТекстОстаткиКПередачеИПотреблению()
	Возврат "
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	НАЧАЛОПЕРИОДА(Расходы.Период, ДЕНЬ) КАК ПериодРасхода,
		|	Расходы.АналитикаУчетаНоменклатуры,
		|	Расходы.ОрганизацияВладелец,
		|	Расходы.ВидЗапасовПродавца,
		|	Расходы.НомерГТД,
		|	МАКСИМУМ(НАЧАЛОПЕРИОДА(Приходы.Период, ДЕНЬ)) КАК ПериодПрихода
		|ПОМЕСТИТЬ
		|	Даты
		|ИЗ
		|	РегистрНакопления.ТоварыОрганизацийКПередаче КАК Расходы
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыЗапасов КАК ВидыЗапасовПродавцов
		|		ПО ВидыЗапасовПродавцов.Ссылка = Расходы.ВидЗапасовПродавца
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыОрганизаций КАК Приходы
		|		ПО Приходы.АналитикаУчетаНоменклатуры = Расходы.АналитикаУчетаНоменклатуры
		|		И Приходы.Период <= КОНЕЦПЕРИОДА(Расходы.Период, ДЕНЬ)
		|		И Приходы.Организация = Расходы.ОрганизацияВладелец
		|		И Приходы.ВидЗапасов = ВидыЗапасовПродавцов.ВидЗапасовВладельца
		|		И Приходы.НомерГТД = Расходы.НомерГТД
		|ГДЕ
		|	Расходы.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|	И Приходы.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|	И (Приходы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ИЛИ Приходы.Количество < 0.)
		|	И &Организация В (НЕОПРЕДЕЛЕНО, Расходы.ОрганизацияВладелец)
		|	И &ОрганизацияПолучатель В (НЕОПРЕДЕЛЕНО, ВидыЗапасовПродавцов.Организация)
		|	И &Склад В (НЕОПРЕДЕЛЕНО, Расходы.АналитикаУчетаНоменклатуры.СкладскаяТерритория)
        |	И &НалоговоеНазначение В (НЕОПРЕДЕЛЕНО, ВидыЗапасовПродавцов.НалоговоеНазначение)
		|	И &ТипЗапасов В (НЕОПРЕДЕЛЕНО, ВидыЗапасовПродавцов.ТипЗапасов)
		|СГРУППИРОВАТЬ ПО
		|	НАЧАЛОПЕРИОДА(Расходы.Период, ДЕНЬ),
		|	Расходы.АналитикаУчетаНоменклатуры,
		|	Расходы.ОрганизацияВладелец,
		|	Расходы.ВидЗапасовПродавца,
		|	Расходы.НомерГТД
		|;
		|
		|ВЫБРАТЬ
		|	ДД.Период,
		|	(ВЫБОР
		|		КОГДА ЕСТЬNULL(Даты.ПериодПрихода, &НачалоПериода) <= НАЧАЛОПЕРИОДА(ДД.Период, МЕСЯЦ) ТОГДА НАЧАЛОПЕРИОДА(ДД.Период, МЕСЯЦ)
		|		КОГДА Даты.ПериодПрихода = ДД.Период ТОГДА ДД.Период
		|		ИНАЧЕ ДОБАВИТЬКДАТЕ(Даты.ПериодПрихода, ДЕНЬ, 1) КОНЕЦ) КАК ДатаОформления,
		|	ДД.ОрганизацияВладелец КАК Отправитель,
		|	ВидыЗапасовПродавцов.Организация КАК Получатель,
		|	ДД.АналитикаУчетаНоменклатуры.МестоХранения КАК Склад,
		|	ДД.АналитикаУчетаНоменклатуры,
		|	ВидыЗапасовПродавцов.ВидЗапасовВладельца КАК ВидЗапасов,
		|	ДД.НомерГТД,
		|	ДД.ВидЗапасовПродавца КАК ВидЗапасовПолучателя,
        |	ВидыЗапасовПродавцов.НалоговоеНазначение,
		|	ВидыЗапасовПродавцов.ТипЗапасов,
		|	(ВЫБОР
		|		КОГДА ДД.КоличествоРасход > ДД.КоличествоПриход ТОГДА ДД.КоличествоРасход - ДД.КоличествоПриход
		|		ИНАЧЕ 0. КОНЕЦ) КАК Передано,
		|	(ВЫБОР
		|		КОГДА ДД.КоличествоПриход > ДД.КоличествоРасход ТОГДА ДД.КоличествоПриход - ДД.КоличествоРасход
		|		ИНАЧЕ 0. КОНЕЦ) КАК Потреблено
		|ИЗ
		|	РегистрНакопления.ТоварыОрганизацийКПередаче.Обороты(
		|		&НачалоПериода, &КонецПериода, ДЕНЬ, &Организация В (НЕОПРЕДЕЛЕНО, ОрганизацияВладелец)
		|	) КАК ДД
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыЗапасов КАК ВидыЗапасовПродавцов
		|		ПО ВидыЗапасовПродавцов.Ссылка = ДД.ВидЗапасовПродавца
		|	ЛЕВОЕ СОЕДИНЕНИЕ Даты КАК Даты
		|		ПО Даты.ПериодРасхода = ДД.Период
		|		И Даты.АналитикаУчетаНоменклатуры = ДД.АналитикаУчетаНоменклатуры
		|		И Даты.ОрганизацияВладелец = ДД.ОрганизацияВладелец
		|		И Даты.ВидЗапасовПродавца = ДД.ВидЗапасовПродавца
		|		И Даты.НомерГТД = ДД.НомерГТД
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыОрганизацийКПередаче.Остатки(&ГраницаПериода) КАК ОстаткиНаКонец
		|	ПО ДД.ОрганизацияВладелец = ОстаткиНаКонец.ОрганизацияВладелец
		|		И ДД.АналитикаУчетаНоменклатуры = ОстаткиНаКонец.АналитикаУчетаНоменклатуры
		|		И ДД.ВидЗапасовПродавца = ОстаткиНаКонец.ВидЗапасовПродавца
		|		И ДД.НомерГТД = ОстаткиНаКонец.НомерГТД
		|
		|ГДЕ
		|	ДД.КоличествоРасход <> ДД.КоличествоПриход
		|	И &ОрганизацияПолучатель В (НЕОПРЕДЕЛЕНО, ВидыЗапасовПродавцов.Организация)
		|	И &Склад В (НЕОПРЕДЕЛЕНО, ДД.АналитикаУчетаНоменклатуры.СкладскаяТерритория)
        |	И &НалоговоеНазначение В (НЕОПРЕДЕЛЕНО, ВидыЗапасовПродавцов.НалоговоеНазначение)
		|	И &ТипЗапасов В (НЕОПРЕДЕЛЕНО, ВидыЗапасовПродавцов.ТипЗапасов)
		|	И ОстаткиНаКонец.КоличествоОстаток <> 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВидыЗапасовПродавцов.Организация,
		|	ДД.ВидЗапасовПродавца,
		|	ДД.ОрганизацияВладелец,
		|	ДД.АналитикаУчетаНоменклатуры,
		|	ДД.НомерГТД,
		|	ДД.Период
		|";
КонецФункции

Процедура ДополнитьТоварыКПередаче(ТоварыКПередаче, Потребления, Передано, ВсеОтборы)
	Для Каждого Потребление Из Потребления Цикл
		Если Передано > 0. Тогда
			Потреблено = Мин(Потребление.Потреблено, Передано);
			Потребление.Потреблено = Потребление.Потреблено - Потреблено;
			Передано = Передано - Потреблено;
		КонецЕсли;
		Если Потребление.Потреблено > 0.
			И Потребление.ДатаОформления >= ВсеОтборы.НачалоПериода
			И Потребление.ДатаОформления <= ВсеОтборы.КонецПериода
		Тогда
			ТоварКПередаче = ТоварыКПередаче.Добавить();
			ЗаполнитьЗначенияСвойств(ТоварКПередаче, Потребление);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область ОбновлениеИнформационнойБазы

// Добавляет в список процедуры-обработчики обновления данных ИБ
// для всех поддерживаемых версий библиотеки или конфигурации.
// Вызывается перед началом обновления данных ИБ для построения плана обновления.
//
//  Обработчики - ТаблицаЗначений - описание полей, см. в процедуре
//                ОбновлениеИнформационнойБазы.НоваяТаблицаОбработчиковОбновления.
//
// Пример добавления процедуры-обработчика в список:
//  Обработчик = Обработчики.Добавить();
//  Обработчик.Версия              = "1.1.0.0";
//  Обработчик.Процедура           = "ОбновлениеИБ.ПерейтиНаВерсию_1_1_0_0";
//  Обработчик.МонопольныйРежим    = Ложь;
//
// Параметры:
// 	Обработчики - см. ОбновлениеИнформационнойБазы.НоваяТаблицаОбработчиковОбновления
//
Процедура ОписаниеОбработчиковОбновления(Обработчики) Экспорт

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.5.4.400";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("7e0bde8f-ffd8-49f0-b145-673e23547702");
	Обработчик.Процедура = "РегистрыНакопления.ТоварыОрганизацийКПередаче.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	Обработчик.ПроцедураЗаполненияДанныхОбновления = "РегистрыНакопления.ТоварыОрганизацийКПередаче.ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию";
	Обработчик.ПроцедураПроверки = "ОбновлениеИнформационнойБазы.ДанныеОбновленыНаНовуюВерсиюПрограммы";
	Обработчик.ЧитаемыеОбъекты = "Документ.СборкаТоваров,"
		+ "Справочник.КлючиАналитикиУчетаНоменклатуры,"
		+ "Справочник.Назначения,"
		+ "РегистрНакопления.ТоварыОрганизацийКПередаче";
	Обработчик.ИзменяемыеОбъекты = "РегистрНакопления.ТоварыОрганизацийКПередаче";
	Обработчик.БлокируемыеОбъекты = "";
	Обработчик.Комментарий = НСтр("ru='Обновляет записи регистра накопления ""Товары организаций к передаче"". Данные в регистре накопления ""Товары организаций к передаче"" не рекомендуется использовать до момента завершения обработки. Данные будут некорректны.';uk='Оновлює записи регістру накопичення ""Товари організацій для передачі"". Дані в регістрі накопичення ""Товари організацій до передачі"" не рекомендується використовувати до завершення обробки. Дані будуть некоректні.'");
	Обработчик.ПриоритетыВыполнения = ОбновлениеИнформационнойБазы.ПриоритетыВыполненияОбработчика();

	

	НоваяСтрока = Обработчик.ПриоритетыВыполнения.Добавить();
	НоваяСтрока.Процедура = "Документы.СборкаТоваров.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	НоваяСтрока.Порядок = "После";
	
	НоваяСтрока = Обработчик.ПриоритетыВыполнения.Добавить();
	НоваяСтрока.Процедура = "Справочники.КлючиАналитикиУчетаНоменклатуры.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	НоваяСтрока.Порядок = "После";

	НоваяСтрока = Обработчик.ПриоритетыВыполнения.Добавить();
	НоваяСтрока.Процедура = "Справочники.Назначения.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	НоваяСтрока.Порядок = "После"; 
	
	НоваяСтрока = Обработчик.ПриоритетыВыполнения.Добавить();
	НоваяСтрока.Процедура = "Справочники.Партнеры.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	НоваяСтрока.Порядок = "После";            
	
	НоваяСтрока = Обработчик.ПриоритетыВыполнения.Добавить();
	НоваяСтрока.Процедура = "РегистрыНакопления.ТоварыОрганизаций.СгенерироватьДокументыДляПереброскиОстатковСПустогоНазначенияПоДавальческойСхеме";
	НоваяСтрока.Порядок = "Любой";
	
	ОбновлениеИнформационнойБазыПереопределяемый.ДобавитьПриоритетыОбработатьДанныеДляГенерацииНазначений(
		Обработчик.ПриоритетыВыполнения,
		"После"
	);
	
	Исключения = ОбновлениеИнформационнойБазыПереопределяемый.ИсключенияПриДобавленииПриоритетов();
	ОбновлениеИнформационнойБазыПереопределяемый.ДобавитьПриоритетыСгенерироватьКлючиАналитикиНоменклатуры(
		Обработчик.ПриоритетыВыполнения,
		"После",
		Исключения
	);	                        

КонецПроцедуры

Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ДополнительныеПараметры = ОбновлениеИнформационнойБазы.ДополнительныеПараметрыОтметкиОбработки();
	ДополнительныеПараметры.ЭтоДвижения = Истина;
	ДополнительныеПараметры.ПолноеИмяРегистра = "РегистрНакопления.ТоварыОрганизацийКПередаче";
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеРегистра.Регистратор КАК Ссылка
	|ПОМЕСТИТЬ ВтДанныеРегистра
	|ИЗ
	|	РегистрНакопления.ТоварыОрганизацийКПередаче КАК ДанныеРегистра
	|ГДЕ
	|	ДанныеРегистра.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СборкаТоваров)
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Движения.Ссылка КАК Ссылка
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВтДанныеРегистра.Ссылка
	|	ИЗ
	|		ВтДанныеРегистра КАК ВтДанныеРегистра
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СборкаТоваров КАК СборкаТоваров
	|		ПО ВтДанныеРегистра.Ссылка = СборкаТоваров.Ссылка
	|			И (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СборкаТоваров) <> СборкаТоваров.ХозяйственнаяОперация)
	|	ГДЕ
	|		НЕ СборкаТоваров.Ссылка ЕСТЬ NULL
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ДанныеРегистра.Регистратор КАК Ссылка
	|	ИЗ
	|		РегистрНакопления.ТоварыОрганизацийКПередаче КАК ДанныеРегистра
	|	ГДЕ
	|		ДанныеРегистра.АналитикаУчетаНоменклатуры.Назначение <> ДанныеРегистра.ВидЗапасовПродавца.УстарелоНазначение
	|		И ДанныеРегистра.ВидЗапасовПродавца.УстарелоНазначение <> ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|		И ДанныеРегистра.ВидЗапасовПродавца <> ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка)
	|
	|	) КАК Движения
	|");
	
	Регистраторы = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	ОбновлениеИнформационнойБазы.ОтметитьКОбработке(
		Параметры, 
		Регистраторы, 
		ДополнительныеПараметры
	);           
	
КонецПроцедуры

Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ПолноеИмяРегистра = "РегистрНакопления.ТоварыОрганизацийКПередаче";
	МетаданныеРегистра = Метаданные.РегистрыНакопления.ТоварыОрганизацийКПередаче;
	
	Регистраторы = Новый Массив;
	Регистраторы.Добавить("Документ.СборкаТоваров");
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	ДополнительныеПараметры = ОбновлениеИнформационнойБазы.ДополнительныеПараметрыОтметкиОбработки();
	ДополнительныеПараметры.ЭтоДвижения = Истина;
	ДополнительныеПараметры.ПолноеИмяРегистра = ПолноеИмяРегистра;
	
	Результат = ОбновлениеИнформационнойБазы.СоздатьВременнуюТаблицуРегистраторовРегистраДляОбработки(
		Параметры.Очередь,
		Неопределено,
		ПолноеИмяРегистра,
		МенеджерВременныхТаблиц
	);
		
	ДополнительныеПараметрыПроверкиБлокировки = ОбновлениеИнформационнойБазы.ДополнительныеПараметрыВыборкиДанныхДляОбработки();
	ДополнительныеПараметрыПроверкиБлокировки.ИмяВременнойТаблицы = "ВтЗаблокированныеСсылки";
	ЗаблокированныеСсылки = ОбновлениеИнформационнойБазы.СоздатьВременнуюТаблицуЗаблокированныхДляЧтенияИИзмененияСсылок(
		Параметры.Очередь,
		Регистраторы,
		МенеджерВременныхТаблиц,
		ДополнительныеПараметрыПроверкиБлокировки
	);
	
	Если НЕ Результат.ЕстьДанныеДляОбработки Тогда
		Параметры.ОбработкаЗавершена = Истина;
		Возврат;
	КонецЕсли;
	
	Если НЕ Результат.ЕстьЗаписиВоВременнойТаблице Тогда
		Параметры.ОбработкаЗавершена = Ложь;
		Возврат;
	КонецЕсли;
	
	ТекстЗапросаВыборки = 
	"ВЫБРАТЬ
	|	СсылкиДляОбработки.Регистратор КАК Регистратор
	|ИЗ
	|	&ВТДляОбработкиСсылка КАК СсылкиДляОбработки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтЗаблокированныеСсылки
	|		ПО СсылкиДляОбработки.Регистратор = ВтЗаблокированныеСсылки.Ссылка
	|ГДЕ
	|	ВтЗаблокированныеСсылки.Ссылка ЕСТЬ NULL
	|";
	
	ТекстЗапросаОбработчика = "
	|ВЫБРАТЬ
	|	Движения.Регистратор                   КАК Регистратор,
	|	Движения.Период                        КАК Период,
	|	Движения.ВидДвижения                   КАК ВидДвижения,
	|	Движения.ОрганизацияВладелец           КАК ОрганизацияВладелец,
	|	ВЫБОР КОГДА Движения.ВидЗапасовПродавца <> ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка)
	|		И Движения.АналитикаУчетаНоменклатуры.Назначение <> Движения.ВидЗапасовПродавца.УстарелоНазначение
	|		И Движения.ВидЗапасовПродавца.УстарелоНазначение <> ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|		И НЕ Аналитика.КлючАналитики ЕСТЬ NULL
	|		ТОГДА Аналитика.КлючАналитики
	|		ИНАЧЕ Движения.АналитикаУчетаНоменклатуры
	|	КОНЕЦ                                  КАК АналитикаУчетаНоменклатуры,
	|	Движения.ВидЗапасовПродавца            КАК ВидЗапасовПродавца,
	|	Движения.НомерГТД                      КАК НомерГТД,
	|	Движения.Количество                    КАК Количество,
	|	Движения.Возвращено                    КАК Возвращено,
	|	Движения.НалоговоеНазначение           КАК НалоговоеНазначение,
	|	ВЫБОР КОГДА НЕ Сборка.ХозяйственнаяОперация ЕСТЬ NULL ТОГДА
	|		Сборка.ХозяйственнаяОперация
	|	ИНАЧЕ
	|		Движения.ХозяйственнаяОперация
	|	КОНЕЦ                                  КАК ХозяйственнаяОперация,
	|	Движения.Номенклатура                  КАК Номенклатура,
	|	Движения.Характеристика                КАК Характеристика,
	|	Движения.КорВидЗапасов                 КАК КорВидЗапасов,
	|	Движения.ДокументРеализации            КАК ДокументРеализации,
	|
	|	ВЫБОР КОГДА Аналитика.КлючАналитики ЕСТЬ NULL
	|		И Движения.АналитикаУчетаНоменклатуры.Назначение <> Движения.ВидЗапасовПродавца.УстарелоНазначение
	|		И Движения.ВидЗапасовПродавца.УстарелоНазначение <> ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|		И Движения.ВидЗапасовПродавца <> ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка)
	|		ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК КлючиИнициализированы
	|ИЗ
	|	РегистрНакопления.ТоварыОрганизацийКПередаче КАК Движения
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Ключи
	|	ПО Ключи.Ссылка = Движения.АналитикаУчетаНоменклатуры
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК Аналитика
	|	ПО Ключи.Номенклатура = Аналитика.Номенклатура
	|		И Ключи.Характеристика = Аналитика.Характеристика
	|		И Ключи.Серия = Аналитика.Серия
	|		И Ключи.МестоХранения = Аналитика.МестоХранения
	|		И Ключи.СтатьяКалькуляции = Аналитика.СтатьяКалькуляции
	|		И Движения.ВидЗапасовПродавца.УстарелоНазначение = Аналитика.Назначение
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.СборкаТоваров КАК Сборка
	|	ПО Движения.Регистратор = Сборка.Ссылка
	|
	|
	|ГДЕ
	|	Движения.Регистратор = &Регистратор
	|УПОРЯДОЧИТЬ ПО
	|	КлючиИнициализированы,
	|	НомерСтроки
	|";
	
	ТекстЗапросаВыборки = СтрЗаменить(ТекстЗапросаВыборки, "&ВТДляОбработкиСсылка", Результат.ИмяВременнойТаблицы);
	
	Запрос = Новый Запрос(ТекстЗапросаВыборки);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	ТаблицаРегистраторов = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаТаблицы Из ТаблицаРегистраторов Цикл
		
		Регистратор = СтрокаТаблицы.Регистратор;
		
		НачатьТранзакцию();
		Попытка
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить(ПолноеИмяРегистра + ".НаборЗаписей");
			ЭлементБлокировки.УстановитьЗначение("Регистратор", Регистратор);
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;

			Блокировка.Заблокировать();
			
			Запрос = Новый Запрос(ТекстЗапросаОбработчика);
			Запрос.УстановитьПараметр("Регистратор", Регистратор);
			
			Набор = РегистрыНакопления.ТоварыОрганизацийКПередаче.СоздатьНаборЗаписей();
			Набор.Отбор.Регистратор.Установить(Регистратор);
			
			Результат = Запрос.Выполнить().Выгрузить();
			Если Результат.Количество() = 0 Тогда
				ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(Регистратор, ДополнительныеПараметры);
				ЗафиксироватьТранзакцию();
				Продолжить;
			ИначеЕсли Результат[0].КлючиИнициализированы = 0 Тогда
				ТекстСообщения = НСтр("ru='есть необновленные ключи. Необходимо перепровести документ вручную.';uk='існують неоновлені ключі. Необхідно перепровести документ вручну.'");
				ВызватьИсключение ТекстСообщения;
			КонецЕсли;
			
			Набор.Загрузить(Результат);
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(Набор);
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ОбновлениеИнформационнойБазыУТ.СообщитьОНеудачнойОбработке(Регистратор);
		КонецПопытки;
	КонецЦикла;
	
	Параметры.ОбработкаЗавершена = Не ОбновлениеИнформационнойБазы.ЕстьДанныеДляОбработки(Параметры.Очередь, ПолноеИмяРегистра);
	
КонецПроцедуры

#КонецОбласти


#КонецЕсли
